artillery/socket_simon.yml
config:
  target: "http://185.251.100.50:8082"
  phases:
    - duration: 10
      arrivalCount: 1
scenarios:
  - engine: "socketio"
    flow:
      - post:
          url: "http://185.251.100.50:8081/api/auth/login"
          json:
            username: "Hubertus"
            password: "asdf"
          capture:
            json: "$.token"
            as: "token"
      - emit:
          channel: "login"
          data: { "token": "{{token}}" }
          response:
            channel: "hello"
      - emit:
          channel: "start-session"
          data:
            {
              "group": { "title": "Walmart" },
              "users": [{ "id": "3", "username": "Herbert" }],
              "startMessageContent": "komm in die gruppe!",
            }
          response:
            channel: "session-started"
      - loop:
          - emit:
              channel: "send-chat-message"
              data:
                {
                  [
                    "send-chat-message",
                    {
                      "message":
                        {
                          "timestamp": "40",
                          "sentBy": { "id": "1", "username": "Simon" },
                          "message": "Hey, wie gehts?",
                        },
                    },
                  ],
                }
        count: 1